from . import jalali
from django.utils import timezone


def jalali_converter(time):
    time = timezone.localtime(time)
    jmonth = { 1:"فروردین" ,2:"اردیبهشت" ,3:"خرداد" ,4:"تیر" ,5:"مرداد" ,6:"شهریور" ,7:"مهر" ,8:"ابان" ,9:"اذر" ,10:"دی" ,11:"بهمن" , 12:"اسفند" }
   # jday = {1:"یکم" ,2:"دوم" ,3:"سوم" ,4:"چهارم" ,5:"پنجم" ,6:"ششم" ,7:"هفتم" ,8:"هشتم" ,9:"نهم" ,10:"دهم" ,11:"یازدهم" ,12:"دوازدهم" ,13:"سیزدهم" ,14:"چهاردهم" ,15:"پانزدهم" ,16:"شانزدهم" ,17:"هفتدهم" ,18:"هجدهم" ,19:"نوزدهم" ,20:"بیستم" ,21:"بیست و یکم" ,22:"بیست و دوم" ,23:"بیست و سوم" ,24:"بیست و چهارم" ,25:"بیست و پنجم" ,26:"بیست و ششم" ,27:"بیست و هفتم" ,28:"بیست و هشتم" ,29:"بیست و نهم" ,30:"سی ام" ,31:"سی و یکم" }
    time_to_str = f'{time.year} {time.month} {time.day}'
    jtime = list(jalali.Gregorian(time_to_str).persian_tuple())
    jtime = f'{jtime[2]} {jmonth[jtime[1]]} {jtime[0]} ساعت {time.hour}:{time.minute}'
   #--------------------------------------------------------------------------------------------------------------------------
    # NUMBER CONVERT TO PERSION
   #--------------------------------------------------------------------------------------------------------------------------
    number = {"0": "۰", "1": "۱", "2": "۲", "3": "۳", "4": "۴", "5": "۵", "6": "۶", "7": "۷", "8": "۸", "9": "۹"}
    for e,p in number.items():
        jtime = jtime.replace(e, p)

    return jtime
